Tekla Open API Reference for Tekla Structures 2025
PlacingQuarterAttributes Constructor
 Creates a new placing quarter attributes instance. The default parameters are: TopLeft = true, TopRight = true, BottomLeft = true, BottomRight = true.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public PlacingQuarterAttributes()
Public Sub New
See Also
Reference
PlacingQuarterAttributes Class
PlacingQuarterAttributes Overload
Tekla.Structures.Drawing Namespace